In [1]:
import numpy as  np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan], index=['a', 'b', 'c', 'd', 'e', 'f' ])

In [5]:
b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.], index=['f', 'e', 'd', 'c', 'b', 'a'])

In [6]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [7]:
b.combine_first(a)

a    5.0
b    2.5
c    0.0
d    2.0
e    4.5
f    0.0
dtype: float64

In [8]:
df1 = pd.DataFrame({'a':[1., np.nan, 5., np.nan], 'b':[np.nan, 2., np.nan, 6.], 'c':range(2, 18, 4)})

In [9]:
df2 = pd.DataFrame({'a':[5., 4., np.nan, 3., 7], 'b':[np.nan, 3., 4.,6.,8.]})

In [10]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [11]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)), index=pd.Index(['ohio', 'colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))

In [12]:
data

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [13]:
result = data.stack()
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [14]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [15]:
result.unstack()

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [16]:
result.unstack(0)

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [17]:
result.unstack('state')

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [18]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [20]:
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [22]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [23]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [24]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [25]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [26]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [27]:
df = DataFrame({'left':result, 'right': result + 5}, columns=pd.Index(['left', 'right'], name='side'))

In [28]:
df

side             left  right
state    number
ohio     one        0      5
         two        1      6
         three      2      7
colorado one        3      8
         two        4      9
         three      5     10

In [29]:
df.unstack('state')

side   left          right
state  ohio colorado  ohio colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [30]:
df.unstack('state').stack('side')

state         colorado  ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [31]:
df = pd.DataFrame({'key':['foo', 'bar', 'baz'], 'A':[1, 2, 3], 'B':[4, 5, 6], 'C':[7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [32]:
melted = pd.melt(df, ['key'])

In [33]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [34]:
reshaped = melted.pivot('key', 'variable', 'value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [35]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [ ]:
pd.melt(df, id_vars['key'], )